<a href="https://colab.research.google.com/github/kovacova/random-magic/blob/master/projects/12-sql-querying.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# SQL Querying in Colab - Tutorial

SQLite is a C library that provides a lightweight disk-based database that doesn‚Äôt require a separate server process and allows accessing the database using a nonstandard variant of the SQL query language. Some applications can use SQLite for internal data storage. It‚Äôs also possible to prototype an application using SQLite and then port the code to a larger database such as PostgreSQL or Oracle. 

SQLite3 is a part of python‚Äôs standard library, which is quite useful. 

<br>

### Main Keywords for SQL Querying:

**SELECT** - how we choose which columns to get

**WHERE** - how we set conditions on the rows to be returned

**LIMIT** - when we only want a certain number of rows

**ORDER** - when we want to sort the output

**JOIN** - when we need data from multiple tables combined

<br>

Useful Resources:

* [Tutorial SQL + Pandas](https://www.dataquest.io/blog/python-pandas-databases/)
* [Pandas Comparison with SQL](https://pandas.pydata.org/pandas-docs/stable/getting_started/comparison/comparison_with_sql.html)
* [Order of Execution of SQL Queries](https://sqlbolt.com/lesson/select_queries_order_of_execution)
* [W3Schools](https://www.w3schools.com/sql/sql_syntax.asp)
* [sqlite3 Documentation](https://pysqlite.readthedocs.io/en/latest/sqlite3.html)

To import the database, we use file upload as `!wget` fails when importing from GitHub. 

Dataset location [here](https://github.com/kovacova/datasets/blob/master/rpg_db.sqlite3).

In [0]:
import sqlite3
import pandas as pd

# Uploading local files
from google.colab import files
files.upload()

### Method 1: Direct Querying

This method returns a list of tuples.

In [16]:
# We must first create a connection object to connect to our SQL database
conn = sqlite3.connect('rpg_db (1).sqlite3')

# Once we have a Connection object, we can then create a Cursor object. Cursors allow us to execute SQL queries against a database
cur = conn.cursor()

# Executes the query
cur.execute("SELECT * FROM armory_item limit 5;").fetchall()  # we use .fetchone() to get a single matching row, and .fetchall() to get all matching rows.

[(1, 'Libero facere dolore, as', 0, 0),
 (2, 'Qui', 0, 0),
 (3, 'Laborios', 0, 0),
 (4, 'Quibusdam illo deserunt ea', 0, 0),
 (5, 'Quod eveniet i', 0, 0)]

### Method 2: Import to Pandas DataFrame

I mean, who doesn't like pretty dataframes? üêº

In [12]:
conn = sqlite3.connect('rpg_db (1).sqlite3')
df = pd.read_sql_query("select * from armory_item limit 5;", conn)  # the CONN argument refers to the SQL database connect statement [conn = sqlite3.connect('rpg_db (1).sqlite3')]
df

   item_id                        name  value  weight
0        1    Libero facere dolore, as      0       0
1        2                         Qui      0       0
2        3                    Laborios      0       0
3        4  Quibusdam illo deserunt ea      0       0
4        5              Quod eveniet i      0       0

## Assignment 

Use sqlite3 to load and write queries to explore the data, and answer the following questions:

* How many total Characters are there?
* How many of each specific subclass?
* How many total Items?
* How many of the Items are weapons? How many are not?
* How many Items does each character have? (Return first 20 rows)
* How many Weapons does each character have? (Return first 20 rows)
* On average, how many Items does each Character have?
* On average, how many Weapons does each character have?

Details [here](https://github.com/LambdaSchool/DS-Unit-3-Sprint-2-SQL-and-Databases/tree/master/module1-introduction-to-sql).

In [24]:
# How many total Characters are there?
q1 = pd.read_sql_query("SELECT COUNT(name) FROM charactercreator_character;", conn)
q1

   COUNT(name)
0          302

In [51]:
# How many of each specific subclass?
q2 = pd.read_sql_query("""SELECT 
                (SELECT COUNT(*) FROM charactercreator_cleric) AS Clerics,
                (SELECT COUNT(*) FROM charactercreator_fighter) AS Fighters,
                (SELECT COUNT(*) FROM charactercreator_mage) AS Mages,
                (SELECT COUNT(*) FROM charactercreator_thief) AS Thieves,
                (SELECT COUNT(*) FROM charactercreator_necromancer) AS Necromancers""", conn)
q2

   Clerics  Fighters  Mages  Thieves  Necromancers
0       75        68    108       51            11

In [43]:
# How many total Items?
q3 = pd.read_sql_query("SELECT COUNT(item_id) FROM armory_item;", conn)
q3

   COUNT(item_id)
0             174

In [49]:
# How many of the Items are weapons? How many are not?
q4 = pd.read_sql_query("""SELECT COUNT(*) FROM armory_item WHERE item_id IN
                       (SELECT distinct item_ptr_id FROM armory_weapon);""", 
                       conn)
q4

   COUNT(*)
0        37

In [0]:
# How many Items does each character have? (Return first 20 rows)
q5 = pd.read_sql_query(" limit 20;", conn)
q5

In [0]:
# How many Weapons does each character have? (Return first 20 rows)
q6 = pd.read_sql_query(" limit 20;", conn)
q6

In [0]:
# On average, how many Items does each Character have?
q7 = pd.read_sql_query("", conn)
q7

In [0]:
# On average, how many Weapons does each character have?
q8 = pd.read_sql_query("", conn)
q8